#include <stdio.h>
//主菜单函数
void showMainMenu(void) 
{
    printf("==============================\n");
    printf("=== 计算机机房设备管理系统 ===\n");
    printf("==============================\n");
    printf("1. 设备信息管理\n2. 设备状态管理\n3. 设备借用管理\n4. 统计报表\n0. 退出系统\n");
    printf("==============================\n");
    printf("请选择操作(0-4): ");
}

//设备信息管理子菜单函数
void showInfoMenu(void) 
{
    printf("\n====================\n");
    printf("=== 设备信息管理 ===\n");
    printf("====================\n");
    printf("1. 添加设备信息\n2. 修改设备信息\n3. 删除设备信息\n4. 查询设备信息\n5. 显示所有设备\n0. 返回上级菜单\n");
    printf("====================\n");
    printf("请选择操作(0-5): ");
}


//设备状态管理子菜单函数
void showStatusMenu(void) 
{
    printf("\n====================\n");
    printf("=== 设备状态管理 ===\n");
    printf("====================\n");
    printf("1. 更新设备状态\n2. 添加维修记录\n3. 查询维修记录\n0. 返回上级菜单\n");
    printf("====================\n");
    printf("请选择操作(0-3): ");
}

//设备借用管理子菜单函数
void showBorrowMenu(void) 
{
    printf("\n====================\n");
    printf("=== 设备借用管理 ===\n");
    printf("====================\n");
    printf("1. 借用设备登记\n2. 归还设备登记\n3. 查询借用记录\n0. 返回上级菜单\n");
    printf("====================\n");
    printf("请选择操作(0-3): ");
}

//统计报表模块函数
void showOverallInfoMenu(void) 
{
    printf("\n====================\n");
    printf("=== 统计报表管理 ===\n");
    printf("====================\n");
    printf("1. 设备分类统计\n2. 设备状态统计\n3. 借用情况统计\n4. 生成报表文件\n0. 返回上级菜单\n");
    printf("====================\n");
    printf("请选择操作(0-4): ");
}